[
  {
    "name": "몽키 D 루피",
    "shortname": "루피",
    "nickname": "밀짚모자",
    "image":"luffy",
    "regiment": "밀짚모자 해적단",
    "devil_fruit": "고무고무 열매",
    "position": "선장",
    "wanted": "5억 베리",
    "bio": "밀짚모자 해적단의 선장이자 본 작품의 주인공. 해적왕을 목표로 하고 있다. 악마의 열매 중 하나인 '고무고무 열매'를 먹은 뒤 온몸을 고무처럼 늘릴 수 있는 능력을 얻어 고무인간이 되었다. 패왕색의 패기 소유자. 자신의 능력을 잘 살린 격투기가 특기이며, 굉장히 낙천적인 성격의 소유자이다. 동료를 자신의 목숨보다도 더 아끼며, 엄청 많이 먹는 대식가. 하지만 살은 찌지 않는다. 가족관계는 해군중장 영웅 거프의 손자이자, 세계최악의 범죄자인 혁명가 몽키.D.드래곤의 아들이다. 그러니까 할아버지는 해군, 아버지는 혁명군, 자신은 해적. 3대가 서로를 적대한다."
  },
  {
    "name": "롤로노아 조로",
    "shortname": "조로",
    "nickname": "해적 사냥꾼",
    "image": "zoro",
    "regiment": "밀짚모자 해적단",
    "devil_fruit": "",
    "position": "부선장",
    "wanted": "3억 2천만 베리",
    "bio": "원래는 대검호 쥬라큘 미호크를 뛰어넘는 세계 제일의 대검호가 되기 위해 여행했지만, 생활비 부족(+방향치라서 길 잃어 못 돌아감)으로 해적 사냥꾼 생활을 하다 합류했다. 삼도류의 달인으로 화도일문자(명검), 3대 귀철(예검), 유바시리(예검)를 소지하고 있었으나, 에니에스 로비에서의 전투에서 유바시리(양검)를 잃은 뒤 스릴러파크에서 사무라이 좀비 류마와의 전투에서 슈스이(명검)를 얻었다. 상디와 마찰을 자주 일으킨다."
  },
  {
    "name": "나미",
    "shortname": "나미",
    "nickname": "도둑 고양이",
    "image": "nami",
    "regiment": "밀짚모자 해적단",
    "devil_fruit": "",
    "position": "항해사",
    "wanted": "6천 6백만 베리",
    "bio": "밀짚모자 해적단의 항해사. 자기 손으로 전 세계의 지도를 그리는 것을 목표로 하고 있다. 우솝이 개발한 크리마 택트(후에 완성판인 퍼펙트 크리마 택트가 된다)를 갖고 있다. 크리마 택트로 기후의 기초성질(따스함, 차가움, 전기)을 이용한 공격을 한다."
  },
  {
    "name": "우솝",
    "shortname": "우솝",
    "nickname": "저격왕",
    "image": "usopp",
    "regiment": "밀짚모자 해적단",
    "devil_fruit": "",
    "position": "저격수(포수)",
    "wanted": "3천만 베리",
    "bio": "저격수이자 포수. 빨간머리 해적단의 저격수인 아버지 야솝을 동경하며, 바다의 전사를 목표로 하고 있다. 직접 개발한 초대형 새총 투구를 사용한다. 저격 실력은 초 수준급. 새총으로도 보통 사람들이 쓰는 총의 사정거리와 조준을 훨씬 능가한다. 용기를 얻거나 변장할 때는 가면을 쓰며 저격왕이라고 자칭한다. 고잉 메리호 시절에는 조선공도 겸했지만 프랑키가 사우전드 써니 호를 밀짚모자 해적단에게 만들어주면서, 밀짚모자 해적단에 가입하자, 조선공 자리를 프랑키에게 넘겨줬다. 어설프지만 그나마 수리나 공작법을 알아서, 고잉 메리호가 숱한 파손을 겪고도 항해를 지속한 건 그때 그때 메리호를 수리한 우솝 덕분이다. 창의력이 뛰어난 편이라 기상을 조작하는 나미의 무기인 크리마텍트의 초기 및 두번째 버젼은 나미와 머리를 맞대고 생각한 아이디어와 우솝의 손재주와 합쳐져서 비롯된 작품이다. 그외에 2년동안 수련하기 전까지 몸은 상대적으로 약하지만 각종 장치들을 이용해 허실을 오가는 야바위로 싸웠으며 벌였으며, 본인이 강해지고 식물을 주로 사용하게된 후로도 전체적으로 함정과 작전에 특화된 트리키한 전술을 쓰는것이 잔재로 남아있다."
  },
  {
    "name": "상디",
    "shortname": "상디",
    "nickname": "검은 다리",
    "image": "sanji",
    "regiment": "밀짚모자 해적단",
    "devil_fruit": "",
    "position": "요리사",
    "wanted": "1억 7천7백만 베리",
    "bio": "본업은 요리사이고 요리실력도 뛰어나지만 애연가인게 문제(...) 하지만 작중 그런게 문제된적은 없다. 그외 사건이 발생하면 묘하게도 대부분 첩보원 역할을 하게되는 경우가 많다. 붉은 다리 제프가 운영하는 해상 레스토랑 발라티에 요리사 출신이자 바람둥이다. 여자를 상당히 밝히고, 여자는 때리지 않는다는 것이 신념. 밀짚모자 일당 중에서도 로빈처럼 주로 배후에서 활동하는데다가 직책도 요리사라서 생각보다는 덜 유명하다. 처음부터 해적 사냥꾼으로 이름을 알리고, 일당에 가입한 조로와 달리, 일반인 신분에서 가입해서 그렇다."
  },
  {
    "name": "토니토니 쵸파",
    "shortname": "쵸파",
    "nickname": "솜사탕 광",
    "image": "chopper",
    "regiment": "밀짚모자 해적단",
    "devil_fruit": "사람사람 열매",
    "position": "의사",
    "wanted": "100베리",
    "bio": "원래는 그냥 평범한 순록이었으나 사람사람 열매를 먹고 수인화되었다. 선의(의사)지만 보통 사건이 끝나고 치료에 들어가기에 작중 의술이 눈에 띄는편은 아니지만, 매번 만신창이가 되는 밀짚모자 일당의 회복은 쵸파가 들어오고 나선 눈에 띄게 빨라졌다."
  },
  {
    "name": "니코 로빈",
    "shortname": "로빈",
    "nickname": "악마의 자식",
    "image": "robin",
    "regiment": "밀짚모자 해적단",
    "devil_fruit": "",
    "position": "고고학자",
    "wanted": "1억 3천만 베리",
    "bio": "원래는 바로크 워크스 부사장이자 크로커다일 파트너인 미스 올 선데이였다. 작중 배에서는 정말 하는일이 없지만(...) 포네그리프를 해독하고 탐험하여 은연중에 향후 일당의 진행방향에 영향을 미치는 경우가 종종있다. 그외 두뇌캐릭터 답게 말로써 상황을 조언하고 때때로 협상하는 참모적인 모습도 조금씩 보일때도 있지만 보통은 배위에서 정말 조용히 자기할거 하는 스타일이다."
  },
  {
    "name": "프랑키",
    "shortname": "프랑키",
    "nickname": "사이보그",
    "image": "franky",
    "regiment": "밀짚모자 해적단",
    "devil_fruit": "",
    "position": "조선공",
    "wanted": "9천 4백만 베리",
    "bio": "밀짚모자 일당의 조선공으로 사우전드 써니 호의 제작자. 원래는 프랑키 일당이라는 해적 겸 해체업자 겸 조선공 무리를 이끌고 있었다. 배를 만드는 능력이 아주 탁월하다. 배를 만들거나 수리하는 기술이 야매인 우솝과는 달리 이쪽은 진짜 프로다. 신체의 절반을 기계로 개조한 사이보그다. 본명은 커티 프람(Cutty Flam). 영국의 유명한 고속 프리깃 선박인 '커티 색'호와 노르웨이의 탐험가 프리드쇼프 난센의 배, '프람'호에서 따온 듯 하다."
  },
  {
    "name": "브룩",
    "shortname": "브룩",
    "nickname": "소울 킹",
    "image": "brook",
    "regiment": "밀짚모자 해적단",
    "devil_fruit": "부활부활 열매",
    "position": "음악가",
    "wanted": "8천 3백만 베리",
    "bio": "나이가 꽤 많다. 심지어 해적왕 골드 로저를 풋내기 해적으로 봤을 정도다. 과거 룸바해적단의 선원이었는데 스릴러파크 편 이후 밀짚모자 일당에 들어오게 되었다. 일당 내에서 음악을 담당하고 있으며 가끔 노래를 불러 분위기를 띄운다. 중간중간 깨알같은 개그를 연발하는것이 특징. 검을 다루는 것에서 조로와 포지션이 겹친다는 우려가있었지만 검술 자체도 펜싱과 비슷한 쾌검을 구사하며 물위를 걷거나 저승의 한기를 검에 실어 공격하는 마검사같은 면모를 보이며(...) 스타일자체가 달라 별상관이 없는듯하다. 본업은 음악가로 음악을 실어 적에게 혼란을 주는 기술도 있는듯하다. 부활부활 열매 능력자로써 한번 죽었다가 살아났다. 살과 내장이 없고 뼈다귀만 남아있다."
  }
]